openfoam-3d-flow-study/supersonic/0/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000;
boundaryField
{
	outlet
	{
		type	zeroGradient;
	}
	inlet
	{
		type	totalPressure;
		p0	uniform 101325;
		gamma	1.399;
	}
	sym1
	{
		type	symmetry;
	}
	sym2
	{
		type	symmetry;
	}
	walls
	{
		type	zeroGradient;
	}
	noseCone
	{
		type	zeroGradient;
	}
}
