openfoam-3d-flow-study/supersonic/0/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 300;
boundaryField
{
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 300;
	}
	inlet
	{
		type	fixedValue;
		value	uniform 300;
	}
	sym1
	{
		type	symmetry;
	}
	sym2
	{
		type	symmetry;
	}
	walls
	{
		type	zeroGradient;
	}
	noseCone
	{
		type	zeroGradient;
	}
}
