openfoam-3d-flow-study/supersonic/system/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	fvOptions;
}
viscousHeating
{
	active	true;
	type	viscousDissipation;
	viscousDissipationCoeffs
	{
		fields	(h);
	}
}
